; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v8 - type_2 ?v7 - type_3)
 	      (pred_3 ?v1 - object ?v7 - type_3)
	      (pred_4 ?v8 - type_2 ?v4 - type_1)
	      (pred_2 ?v8 - type_2 ?v1 - object ?v4 - type_1))

   (:action op_1
       :parameters  (?v8 - type_2 ?v2 ?v6 - type_3)
       :precondition (and  (pred_1 ?v8 ?v2))
       :effect (and  (pred_1 ?v8 ?v6)
		     (not (pred_1 ?v8 ?v2))))

   (:action op_2
       :parameters (?v8 - type_2 ?v5 - object ?v3 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_3 ?v5 ?v3) (pred_1 ?v8 ?v3) (pred_4 ?v8 ?v4))
       :effect (and (pred_2 ?v8 ?v5 ?v4)
		    (not (pred_3 ?v5 ?v3)) 
		    (not (pred_4 ?v8 ?v4))))

   (:action op_3
       :parameters (?v8 - type_2 ?v5 - object ?v3 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v8 ?v5 ?v4) (pred_1 ?v8 ?v3))
       :effect (and (pred_3 ?v5 ?v3)
		    (pred_4 ?v8 ?v4)
		    (not (pred_2 ?v8 ?v5 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_04 obj_09 - type_2
obj_08 obj_03 obj_12 obj_11 - type_1
obj_01 obj_10 obj_02 - type_3
obj_06 obj_07 obj_05 - object)
(:init
(pred_1 obj_04 obj_01)
(pred_4 obj_04 obj_08)
(pred_4 obj_04 obj_03)
(pred_1 obj_09 obj_10)
(pred_4 obj_09 obj_12)
(pred_4 obj_09 obj_11)
(pred_3 obj_06 obj_10)
(pred_3 obj_07 obj_01)
(pred_3 obj_05 obj_01)
)
(:goal
(and
(pred_3 obj_06 obj_10)
(pred_3 obj_07 obj_10)
(pred_3 obj_05 obj_01)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_04 obj_10) (pred_1 obj_09 obj_10))))
  )
)
)

; plan
1. (op_2 obj_04 obj_07 obj_01 obj_03)
   deleted: (pred_3 obj_07 obj_01) (pred_4 obj_04 obj_03)
   added: (pred_2 obj_04 obj_07 obj_03)
   goals met: 2 of 3
2. (op_1 obj_09 obj_10 obj_01)
   deleted: (pred_1 obj_09 obj_10)
   added: (pred_1 obj_09 obj_01)
   goals met: 2 of 3
3. (op_1 obj_04 obj_01 obj_10)
   deleted: (pred_1 obj_04 obj_01)
   added: (pred_1 obj_04 obj_10)
   goals met: 2 of 3
4. (op_3 obj_04 obj_07 obj_10 obj_03)
   deleted: (pred_2 obj_04 obj_07 obj_03)
   added: (pred_3 obj_07 obj_10) (pred_4 obj_04 obj_03)
   goals met: 3 of 3
